; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	infrared2 - mode
	image1 - mode
	Star0 - direction
	Star3 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
)
(:goal (and
	(have_image Planet5 infrared2)
	(have_image Phenomenon6 infrared2)
	(have_image Planet7 thermograph0)
	(have_image Star8 image1)
	(have_image Phenomenon9 infrared2)
	(have_image Star10 infrared2)
))

)

; plan
1. (turn_to satellite0 star1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 6
5. (take_image satellite0 phenomenon9 instrument0 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon6 instrument0 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 2 of 6
8. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   goals met: 2 of 6
9. (take_image satellite0 planet5 instrument0 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 3 of 6
10. (turn_to satellite0 planet7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet7)
   goals met: 3 of 6
11. (take_image satellite0 planet7 instrument0 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 4 of 6
12. (turn_to satellite0 star10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star10)
   goals met: 4 of 6
13. (take_image satellite0 star10 instrument0 infrared2)
   added: (have_image star10 infrared2)
   goals met: 5 of 6
14. (turn_to satellite0 star8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star8)
   goals met: 5 of 6
15. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 6 of 6
